Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.grafana-agent will be updated in-place
~ resource "helm_release" "grafana-agent" {
        id                         = "grafana-agent"
      ~ metadata                   = [
          - {
              - app_version = "v0.37.4"
              - chart       = "grafana-agent"
              - name        = "grafana-agent"
              - namespace   = "grafana"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - agent   = {
                          - configMap    = {
                              - content = <<-EOT
                                    faro.receiver "default" {
                                      output {
                                          logs   = [loki.write.default.receiver]
                                      }
                                    }
                                    
                                    loki.write "default" {
                                        endpoint {
                                            url = "http://loki-gateway/loki/api/v1/push"
                                        }
                                    }
                                EOT
                            }
                          - uiPathPrefix = "/agent-grafana"
                        }
                      - ingress = {
                          - enabled = true
                          - hosts   = [
                              - "gently-concise-dogfish.ngrok-free.app",
                            ]
                          - path    = "/faro"
                        }
                    }
                )
              - version     = "0.27.2"
            },
        ] -> (known after apply)
        name                       = "grafana-agent"
      ~ values                     = [
          - <<-EOT
                agent:
                  configMap:
                    content: |
                      faro.receiver "default" {
                        output {
                            logs   = [loki.write.default.receiver]
                        }
                      }
                
                      loki.write "default" {
                          endpoint {
                              url = "http://loki-gateway/loki/api/v1/push"
                          }
                      }
                  uiPathPrefix: "/agent-grafana"
                ingress:
                  enabled: true
                  hosts: ["gently-concise-dogfish.ngrok-free.app"]
                  path: "/faro"
            EOT,
          + <<-EOT
                agent:
                  configMap:
                    content: |
                      faro.receiver "default" {
                        output {
                            logs   = [loki.write.default.receiver]
                        }
                      }
                
                      loki.write "default" {
                          endpoint {
                              url = "http://loki-gateway/loki/api/v1/push"
                          }
                      }
                  uiPathPrefix: "/agent-grafana"
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.kubernetes.module.grafana.kubernetes_manifest.grafana-agent-ingress will be updated in-place
~ resource "kubernetes_manifest" "grafana-agent-ingress" {
      ~ manifest = {
          ~ spec       = {
              ~ routes      = [
                    {
                        kind     = "Rule"
                        match    = "PathPrefix(`/agent-grafana`)"
                        services = [
                            {
                                name = "grafana-agent"
                                port = 80
                            },
                        ]
                    },
                  + {
                      + kind     = "Rule"
                      + match    = "PathPrefix(`/faro-grafana`)"
                      + services = [
                          + {
                              + name = "grafana-faro"
                              + port = 80
                            },
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ routes      = [
                    {
                        kind        = "Rule"
                        match       = "PathPrefix(`/agent-grafana`)"
                        middlewares = null
                        priority    = null
                        services    = [
                            {
                                kind               = null
                                name               = "grafana-agent"
                                namespace          = null
                                nativeLB           = null
                                passHostHeader     = null
                                port               = "80"
                                responseForwarding = {
                                    flushInterval = null
                                }
                                scheme             = null
                                serversTransport   = null
                                sticky             = {
                                    cookie = {
                                        httpOnly = null
                                        name     = null
                                        sameSite = null
                                        secure   = null
                                    }
                                }
                                strategy           = null
                                weight             = null
                            },
                        ]
                    },
                  + {
                      + kind        = "Rule"
                      + match       = "PathPrefix(`/faro-grafana`)"
                      + middlewares = (known after apply)
                      + priority    = (known after apply)
                      + services    = [
                          + {
                              + kind               = (known after apply)
                              + name               = "grafana-faro"
                              + namespace          = (known after apply)
                              + nativeLB           = (known after apply)
                              + passHostHeader     = (known after apply)
                              + port               = "80"
                              + responseForwarding = {
                                  + flushInterval = (known after apply)
                                }
                              + scheme             = (known after apply)
                              + serversTransport   = (known after apply)
                              + sticky             = {
                                  + cookie = {
                                      + httpOnly = (known after apply)
                                      + name     = (known after apply)
                                      + sameSite = (known after apply)
                                      + secure   = (known after apply)
                                    }
                                }
                              + strategy           = (known after apply)
                              + weight             = (known after apply)
                            },
                        ]
                    },
                ]
                # (2 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.kubernetes.module.grafana.kubernetes_manifest.grafana-faro-svc will be created
+ resource "kubernetes_manifest" "grafana-faro-svc" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "Service"
          + metadata   = {
              + name      = "grafana-faro"
              + namespace = "grafana"
            }
          + spec       = {
              + ports    = [
                  + {
                      + name       = "http-faro"
                      + port       = 80
                      + protocol   = "TCP"
                      + targetPort = 12347
                    },
                ]
              + selector = {
                  + "app.kubernetes.io/instance" = "grafana-agent"
                  + "app.kubernetes.io/name"     = "grafana-agent"
                }
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "Service"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "grafana-faro"
              + namespace                  = "grafana"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + allocateLoadBalancerNodePorts = (known after apply)
              + clusterIP                     = (known after apply)
              + clusterIPs                    = (known after apply)
              + externalIPs                   = (known after apply)
              + externalName                  = (known after apply)
              + externalTrafficPolicy         = (known after apply)
              + healthCheckNodePort           = (known after apply)
              + internalTrafficPolicy         = (known after apply)
              + ipFamilies                    = (known after apply)
              + ipFamilyPolicy                = (known after apply)
              + loadBalancerClass             = (known after apply)
              + loadBalancerIP                = (known after apply)
              + loadBalancerSourceRanges      = (known after apply)
              + ports                         = [
                  + {
                      + appProtocol = (known after apply)
                      + name        = "http-faro"
                      + nodePort    = (known after apply)
                      + port        = 80
                      + protocol    = "TCP"
                      + targetPort  = "12347"
                    },
                ]
              + publishNotReadyAddresses      = (known after apply)
              + selector                      = {
                  + "app.kubernetes.io/instance" = "grafana-agent"
                  + "app.kubernetes.io/name"     = "grafana-agent"
                }
              + sessionAffinity               = (known after apply)
              + sessionAffinityConfig         = {
                  + clientIP = {
                      + timeoutSeconds = (known after apply)
                    }
                }
              + type                          = (known after apply)
            }
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 1 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`